In [1]:
import pandas as pd

In [8]:
departments = pd.read_csv("../EmployeeSQL/departments.csv")
dept_emp = pd.read_csv("../EmployeeSQL/dept_emp.csv")
dept_manager = pd.read_csv("../EmployeeSQL/dept_manager.csv")
employees = pd.read_csv("../EmployeeSQL/employees.csv")
titles = pd.read_csv("../EmployeeSQL/titles.csv")
salaries = pd.read_csv("../EmployeeSQL/salaries.csv")

In [5]:
departments

  dept_no           dept_name
0    d001           Marketing
1    d002             Finance
2    d003     Human Resources
3    d004          Production
4    d005         Development
5    d006  Quality Management
6    d007               Sales
7    d008            Research
8    d009    Customer Service

In [9]:
salaries.head()

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10002   65828  1996-08-03  1997-08-03
2   10003   40006  1995-12-03  1996-12-02
3   10004   40054  1986-12-01  1987-12-01
4   10005   78228  1989-09-12  1990-09-12

In [16]:
titles.head()
print(titles["emp_no"].count())
print(titles["emp_no"].nunique())

443308
300024

In [39]:
employees.head()
print(employees["emp_no"].nunique())
employees.head()

300024

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [30]:
salaries.head()
salaries["emp_no"].count()

300024

In [37]:
dept_emp.head()

print(dept_emp["emp_no"].count())
print(dept_emp["emp_no"].nunique())

331603
300024

In [38]:
print(employees["emp_no"].count())
print(employees["emp_no"].nunique())

print(salaries["emp_no"].count())
print(salaries["emp_no"].nunique())

300024
300024
300024
300024

In [41]:
print(dept_emp["emp_no"].count())
print(dept_emp["emp_no"].nunique())

331603
300024

In [42]:
dept_emp.head()

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01

In [44]:
dept_manager["emp_no"].nunique()

24

In [45]:
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [47]:
employees["emp_no"].nuniqueque()

300024

In [51]:
titles["emp_no"].count()- titles["emp_no"].nunique()

143284

In [53]:
salaries["emp_no"].nunique()

300024

In [59]:
employees["emp_no"].count()

300024

In [58]:
dude = dept_emp.loc[dept_emp["emp_no"]==110039]
dude

        emp_no dept_no   from_date     to_date
110522  110039    d001  1986-04-12  9999-01-01

In [66]:
employees.head()
group = employees.groupby("last_name")
group.count()

           emp_no  birth_date  first_name  gender  hire_date
last_name
Aamodt        205         205         205     205        205
Acton         189         189         189     189        189
Adachi        221         221         221     221        221
Aingworth     172         172         172     172        172
Akaboshi      199         199         199     199        199
...           ...         ...         ...     ...        ...
Zweizig       180         180         180     180        180
Zwicker       176         176         176     176        176
Zyda          181         181         181     181        181
Zykh          148         148         148     148        148
dAstous       166         166         166     166        166

[1638 rows x 5 columns]